EkspoNet/Documents/Сдача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Сдача</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЭкспонатыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПриемки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПриемкиЭкспонатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательУведомлений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сдающий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Экспонаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>8</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеЭкспоната</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаленькийЭкспонат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Экспонат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Экспонаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сохранность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EkspoNet/AccumulationRegisters/ЭкспонатыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЭкспонатыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Экспонат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Экспонаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

EkspoNet/Enums/ВидыПриемкиЭкспонатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПриемкиЭкспонатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ручной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматический</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

EkspoNet/Catalogs/Экспонаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Экспонаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеЭкспоната</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяПриемки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательУведомлений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаленькийЭкспонат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлениеОПриемкеЭкспоната</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлениеООтправкеЭкспоната</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкспонатОтправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребованияКПеремещению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерыВес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииЭкспонатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сохранность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EkspoNet/Documents/Сдача/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПолучательУведомлений.Пустая() Тогда
		ПолучательУведомлений = Справочники.Пользователи.НайтиПоРеквизиту("УникальныйИдентификатор",ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	КонецЕсли;
	
	Для Каждого СтрокаЭкспонат Из Экспонаты Цикл
		
		Если ВидПриемки = Перечисления.ВидыПриемкиЭкспонатов.Автоматический Тогда
			//что-то
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаЭкспонат.Экспонат) Тогда
			ОбъектЭкспонат = СтрокаЭкспонат.Экспонат.ПолучитьОбъект();
		Иначе
			ОбъектЭкспонат = Справочники.Экспонаты.СоздатьЭлемент();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОбъектЭкспонат, СтрокаЭкспонат);
		
		Если ЗначениеЗаполнено(Дата) Тогда 
			ОбъектЭкспонат.ДатаИВремяПриемки = Дата;
		Иначе   
			ОбъектЭкспонат.ДатаИВремяПриемки = ТекущаяДата();
		КонецЕсли;		
		
		ОбъектЭкспонат.ПолучательУведомлений = ПолучательУведомлений;
		ОбъектЭкспонат.Наименование = "№" + ОбъектЭкспонат.Идентификатор + " Название экспоната: " + ОбъектЭкспонат.НазваниеЭкспоната;
		
		ОбъектЭкспонат.Автор = СтрокаЭкспонат.Автор;
		ОбъектЭкспонат.Описание = СтрокаЭкспонат.Описание;
		ОбъектЭкспонат.Сохранность = СтрокаЭкспонат.Сохранность;
		
		ОбъектЭкспонат.Записать();
		СтрокаЭкспонат.Экспонат = ОбъектЭкспонат.Ссылка;
		
	КонецЦикла;
	
	Если ПолучательУведомлений.Пустая() Тогда
		ПолучательУведомлений = Справочники.Пользователи.НайтиПоРеквизиту("УникальныйИдентификатор",ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	КонецЕсли;

	ОбъектЭкспонат.Записать();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЭкспонатыНаСкладах Приход
	Движения.ЭкспонатыНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаЭкспонаты Из Экспонаты Цикл
		
		Если ВидПриемки = Перечисления.ВидыПриемкиЭкспонатов.Автоматический И ТекСтрокаЭкспонаты.Ячейка.Пустая() Тогда
			ТекСтрокаЭкспонаты.Ячейка = ПолучитьЯчейку();
			
			Если ТекСтрокаЭкспонаты.Ячейка.Пустая() Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Нет свободной ячейки";
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
			
		ИначеЕсли ВидПриемки = Перечисления.ВидыПриемкиЭкспонатов.Ручной и НЕ ТекСтрокаЭкспонаты.МаленькийЭкспонат Тогда
			Если ЯчейкаЗанята(ТекСтрокаЭкспонаты.Ячейка) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ячейка занята: " + Строка(ТекСтрокаЭкспонаты.Ячейка);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Движение = Движения.ЭкспонатыНаСкладах.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Ячейка = ТекСтрокаЭкспонаты.Ячейка;
		Движение.Экспонат = ТекСтрокаЭкспонаты.Экспонат;
		Движение.Количество = 1; 
		
		Движения.ЭкспонатыНаСкладах.Записать(Истина);
		
	КонецЦикла;
	
	ПроверкаНаНаличиеСвободныхЯчеек();

КонецПроцедуры

Функция ПолучитьЯчейку()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ячейки.Ссылка КАК Ячейка,
		|	СУММА(ЕСТЬNULL(ЭкспонатыНаСкладахОстатки.КоличествоОстаток, 0)) КАК КолВоЭкспонатов
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.Ячейки КАК Ячейки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЭкспонатыНаСкладах.Остатки КАК ЭкспонатыНаСкладахОстатки
		|		ПО Ячейки.Ссылка = ЭкспонатыНаСкладахОстатки.Ячейка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ячейки.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Ячейка КАК Ячейка,
		|	ВТ.КолВоЭкспонатов КАК КолВоЭкспонатов
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.КолВоЭкспонатов = 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ячейка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ячейка;
	КонецЦикла;
	
	Возврат Справочники.Ячейки.ПустаяСсылка();
	
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	Экспонаты.Очистить();
КонецПроцедуры

Функция ПроверкаНаНаличиеСвободныхЯчеек()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ячейки.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(ЭкспонатыНаСкладахОстатки.КоличествоОстаток, 0) КАК Экспонатов
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	Справочник.Ячейки КАК Ячейки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЭкспонатыНаСкладах.Остатки КАК ЭкспонатыНаСкладахОстатки
		|		ПО Ячейки.Ссылка = ЭкспонатыНаСкладахОстатки.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.Ссылка КАК Ссылка,
		|	ВТ.Экспонатов КАК Экспонатов
		|ИЗ
		|	ВТ КАК ВТ
		|ГДЕ
		|	ВТ.Экспонатов = 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "На складе закончились ячейки";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецФункции

Функция ЯчейкаЗанята(Ячейка)
	
	ЭкспонатовВЯчейке = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭкспонатыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ЭкспонатыНаСкладах.Остатки(, Ячейка = &Ячейка) КАК ЭкспонатыНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЭкспонатовВЯчейке = ЭкспонатовВЯчейке + ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;
	
	Если ЭкспонатовВЯчейке > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

	
	
КонецФункции
